Repository: XenonCoder/minetest_italia
Catalog: mods/death_messages/locale/*.po
Languages: it

source: Your character
it: Il vostro personaggio

source: drowned.
it: è affogat*.

source: ran out of air.
it: ha esaurito l'aria.

source: failed at swimming lessons.
it: non riusciva a fare le lezioni di nuoto.

source: tried to impersonate an anchor.
it: ha tentato di imitare un'ancora.

source: forgot he wasn't a fish.
it: ha dimenticato di non essere un pesce.

source: blew one too many bubbles.
it: ha scoppiato una bolla di troppo.

source: burned to a crisp.
it: è stat* bruciat* in un croccante.

source: got a little too warm.
it: è diventat* un po' troppo cald*.

source: got too close to the camp fire.
it: si è avvicinat* troppo al fuoco di bivacco.

source: just got roasted, hotdog style.
it: è stat* proprio arrostit*, stile hotdog.

source: got burned up. More light that way.
it: è stat* bruciato. Così è più legger*.

source: melted into a ball of fire.
it: si è fus* in una palla di fuoco.

source: thought lava was cool.
it: ha pensato che la lava fosse figa.

source: couldn't resist that warm glow of lava.
it: non ha potuto resistere al caldo brillare della lava.

source: dug straight down.
it: ha scavato dritto sotto di sé.

source: went into the lava curtain.
it: è andat* nella cortina di lava.

source: thought it was a hottub.
it: ha pensato che fosse una sauna bollente.

source: is melted.
it: è fus*.

source: didn't know lava was hot.
it: non sapeva che la lava è bollente.

source: melted into a ball of radioactivity.
it: si è fus* in una palla di radioattività.

source: thought chemical waste was cool.
it: ha pensato che la morte chimica fosse figa.

source: melted into a jittering pile of flesh.
it: si è sciolt* in un mucchietto di carne rabbrividente.

source: couldn't resist that warm glow of toxic water.
it: non ha potuto resistere al caldo brillare dell'acqua tossica.

source: went into the toxic curtain.
it: è andat* nella cortina tossica.

source: thought it was a toxic-tub.
it: ha pensato che fosse una sauna tossica.

source: is radioactive.
it: è radioattiv*.

source: didn't know toxic water was radioactive.
it: non sapeva che l'acqua tossica fosse radioattiva.

source: died.
it: è morto.

source: did something fatal.
it: ha fatto qualcosa di mortale.

source: gave up on life.
it: ha rinunciato alla vita.

source: is somewhat dead now.
it: ora è un po' mort*.

source: passed out -permanently.
it: è svenut* - permanentemente.

source: kinda screwed up.
it: ha fatto un po' una cazzata.

source: couldn't fight very well.
it: non sapeva combattere molto bene.

source: got 0wn3d.
it: è stat* pres*.

source: got SMOKED.
it: è stat* ridott* in fumo.

source: got hurted by Oerkki.
it: è stat* ferito da Oerkki.

source: got blowed up.
it: è stat* fatt* saltare in aria.

source: and was eaten with a gurgling growl.
it: ed è stat* inghiottit* con un ruggito gorgogliante.

source: then was cooked for dinner.
it: poi è stat* cucinat* per cena.

source: then went to the supermarket.
it: poi è finit* al supermercato.

source: badly.
it: malamente.

source: terribly.
it: terribilmente.

source: horribly.
it: orribilmente.

source: in a haphazard way.
it: a casaccio.

source: that sparkles in the twilight with that evil grin.
it: che scintilla nel crepuscolo con un ghigno malvagio.

source: and now is covered by blood.
it: e adesso è copert* di sangue.

source: so swiftly, that not even Chuck Norris could block.
it: così velocemente, che nemmeno Chuck Norris avrebbe potuto parare.

source: for talking smack about Oerkkii's mother.
it: per avere parlato sconciamente della madre di Oerkki.

source: and grimmaced wryly.
it: e ha fatto una smorfia di disappunto.

source: fisted
it: pres* a pugni

source: sliced up
it: affettat*

source: rekt
it: scassat*

source: punched
it: pres* a pugni

source: hacked
it: fatt* a pezzi

source: skewered
it: infilzat* come uno spiedino

source: blasted
it: fatt* saltare

source: tickled
it: solleticat*

source: gotten
it: pres*

source: sword checked
it: controllat* a fil di spada

source: turned into a jittering pile of flesh
it: trasformat* in un mucchio di carne agghiacciante

source: buried
it: sotterrat*

source: served
it: servit*

source: poked
it: spint*

source: attacked viciously
it: attaccat* brutalmente

source: busted up
it: fracassat*

source: schooled
it: istruit*

source: told
it: sgridat*

source: learned
it: ripassat*

source: chopped up
it: tagliat* di netto

source: deader than ded ded ded
it: presentat* alla Morte

source: CHOSEN to be the ONE
it: prescelt* per essere l'elett*

source: all kinds of messed up
it: incasinat* di brutto

source: smoked like a Newport
it: fumat* come una Newport

source: hurted
it: ferit*

source: ballistic-ed
it: balistica-t*

source: jostled
it: spintonat*

source: messed-da-frig-up
it: ribaltat* completamente

source: lanced
it: incis*

source: shot
it: sparat*

source: knocked da heck out
it: pestat* per bene

source: pooped on
it: scagazzat*

source: for talking smack about thier mother.
it: per avere parlato sconciamente di sua madre.

source: for cheating at Tic-Tac-Toe.
it: per avere barato a tela.

source: for being a stinky poop butt.
it: per essere un popò che puzza di pupù.

source: for letting Baggins grief.
it: per avere lasciato soffrire Baggins.

source: because it felt like the right thing to do.
it: perché sembrava la cosa giusta da fare.

source: for spilling milk.
it: per avere rovesciato il latte.

source: for wearing a n00b skin.
it: perché usa una skin da novellin*.

source: for not being good at PVP.
it: perché non è capace di lottare.

source: because they are a n00b.
it: perché è un* novellin*.

source: for reasons uncertain.
it: per motivi incerti.

source: for using a tablet.
it: perché usa un tablet.

source: with the quickness.
it: con velocità.

source: while texting.
it: mentre scriveva.

source: was
it: è stat*

source: by
it: da

source: with
it: con

source: a Wooden Pick
it: un piccone di legno

source: a Stone Pick
it: un piccone di pietra

source: a Steel Pick
it: un piccone di acciaio

source: a Bronze Pick
it: un piccone di bronzo

source: a Mese Pick
it: un piccone di mese

source: a Diamond Pick
it: un piccone di diamante

source: a Wooden Shovel
it: una zappa di legno

source: a Stone Shovel
it: una zappa di pietra

source: a Steel Shovel
it: una zappa di acciaio

source: a Bronze Shovel
it: una zappa di bronzo

source: a Mese Shovel
it: una zappa di mese

source: a Diamond Shovel
it: una zappa di diamante

source: a Wooden Axe
it: un'accetta di legno

source: a Stone Axe
it: un'accetta di pietra

source: a Steel Axe
it: un'accetta di acciaio

source: a Bronze Axe
it: un'accetta di bronzo

source: a Mese Axe
it: un'accetta di mese

source: a Diamon Axe
it: un'accetta di diamante

source: a Wooden Sword
it: una spada di legno

source: a Stone Sword
it: una spada di pietra

source: a Steel Sword
it: una spada di acciaio

source: a Bronze Sword
it: una spada di bronzo

source: a Mese Sword
it: una spada di mese

source: a Diamond Sword
it: una spada di diamante

source: a cow
it: una mucca

source: a warthog
it: un facocero

source: a dungeon master
it: un signore dei sotterranei

source: a sand monster
it: un mostro di sabbia

source: an Oerkki
it: un Oerkki

source: a stone monster
it: un mostro di pietra

source: a lava flan
it: uno sformato di lava

source: a spider
it: un ragno

source: a mese monster
it: un mostro di mese

source: a tree monster
it: un albero mostro

source: a dirt monster
it: un mostro di terra

source: a goblin
it: un folletto

source: a goblin king
it: un re folletto

source: a crocodile
it: un coccodrillo

source: a large shark
it: uno squalo grande

source: a medium shark
it: uno squalo medio

source: a small shark
it: uno squalo piccolo
